"use strict";

let number = 10;

if (number != 10) {
    alert("hello");
}

/*এটা এক্সিকিউট হবে না। কারণ হলো এই variable এর ভিতরে  let num = 10; হয়েছে এবং if condition এর ভিতরে if (num != 10) নেওয়া হয়েছে । (num != 10) এর অর্থ হলো num !( not ) =10 নেওয়ায় variable এবং if condition এর একই value হলো 10 । এখানে শর্ত হলো  num !( not ) =10 অর্থাৎ variable এবং if condition এর একই value হবে না যখন তখনি এক্সিকিউট হবে । এখানে সবার value একই হওয়ায় value টি এক্সিকিউট হবে না ।*/

//===========================================================

let number2 = 20;

if (number2 != 15) {
    alert("Hello");
}

// এটা এক্সিকিউট হবে কারণ হলো variable এবং if condition এর value আলাদা আলাদা

//======= 8 মিনিট ===============================================

let number3 = 30;

if (number3 == 25) {
    alert("Zhumu");
}

/*এখানে variable এর value = 30 এবং fi condition এর ভিতরে ডবল ইকুয়াল ( == ) অর্থাৎ ইকুয়ালের value 25 হওয়ায় এটি এক্সিকিউট হবে না । কারণ এখানে ডবল ইকুয়াল ( == ) অর্থাৎ ইকুয়াল ব্যবহার করায় এক্সিকিউট হবার জন্য দুটি value একই হতে হবে । */

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

let number4 = 40;

if (!(number4 == 30)) {
    alert("Ibrahim");
}

/* এখানে ডবল ইকুয়াল (==) বা ইকুয়াল value কে Logical (!) Not Operator এর মাধ্যমে এক্সিকিউট করতে হলে if condition এর সবগুলো একটি প্রথম বন্ধনির () এর ভিতরে রেখে তার সামনে (!) Not চিহ্ন দিতে হয়  এবং এই Not চিহ্ন সহ condition এর সমস্ত value এর একটি প্রথম বন্ধ ()দিতে হয় */

/*======= 11 মিনিট ===============================================

 কারেক্টর অর্থাৎ নির্দেষ্ট সংখ্যা সিলেক্ট করে দেওয়ার নিয়ম 

 ===============================================================*/

let number5 = 10;

if (number5 >= 3 && number5 <= 10) {
    alert("valide");
} else {
    alert("invalide");
}
// এখানে if condition এর ভিতরে দেখানো হয়েছে 3 এর বড় এবং 10 এর ছোট যেকোন সংখ্যা নেওয়া যাবে এবং if condition এর সর্বচ্চ মান যদি variable এর মানের সমান হয় তখন if condition এর alert এর ভিতরে যেটি থাকবে সেটি এক্সিকিউট হবে । তানাহলে else এর ভিতরে যেটি থাকবে সিটি এক্সিকিউট হবে । এখানে variable এর মান এবং if condition এর সর্বচ্চ মান একই হওয়ায় valide এক্সিকিউট হবে ।

//==========================================================

alert("Mim");

let number6 = 10;

if (!(number6 >= 4 && number6 <= 7)) {
    alert("Valide");
} else {
    alert("invalide");
}

// এখানে if condition এর ভিতরে 4 এর বড় কিন্তু 7 এর দেখানো হয়েছে এবং let নামক variable এর মান নেওয়া হয়েছে 10 যা if condition এর সর্বচ্চ মানের সাথে মিল নাই । if condition এর ভিতরে  Logical (!) Not Operator ব্যবহার করায় variable এর মানের সাথে if condition এর সর্বচ্চ মান একই না হওয়া valide টি এক্সিকিউট হয়েছে ।

// =========== 23 মিনিট ========================================

let text = !null;
console.log(text);

// null এর অর্থ হলো Not a number এই null কে boolean data type এ convat করলে False হবে । আর এখানে Null এর আগে Not (!) চিহ্ন ব্যবহার করায় false টি true তে পরিনত হয়েছে ।

//========= 24 মিনিট ===========================================

let text1 = !!null;
console.log(text1);

// এখানে ডবর not ( !! ) ব্যবহার করায় false দেখাবে ।
