"use strict";

let amount = 20;
amount = amount + 30; // amount নামক variable এর ভিতরে মোট 50 store হবে। amount + 30 এখানে এই amount এর মান হলো উপরের 20 ।
alert(amount);

//====================Modify assign ==================================================
/* ------  ( += এডিশন ইকুয়াল ) ---------------------- */
//====================================================================================
//উপরের mount = amount + 30; লাইনের Short Hand রূপ হলো amount1 += 60; দুটোর কাজ একই। amount1 += এর অর্থ হলো প্রথমন লাইনের let amount1 এর value যুক্ত হয়ে দ্বিতীয় লাইনের value 60 এর সাথে যুক্ত হয়ে (30+60) বা 90 দেখাবে ।

let amount1 = 30;
amount1 += 60;
alert(amount1);

//====================Modify assign ==================================================
/* ------   ( -= সাবসট্রাকশন ইকুয়াল) --------------------- */
//====================================================================================

let amount2 = 90;
amount2 -= 50; // এখানে রেজাল্ট হবে 90-50=40
alert(amount2);

let amount3 = 20;
amount3 -= 70; // এখানে রেজাল্ট হবে 20-70=-50
alert(amount3);

//====================Modify assign ==================================================
/* ------ (  *= মাল্টিফিকেশন ইকুয়াল ) --------------------- */
//====================================================================================

let amount4 = 25;
amount4 *= 2 + 2;
alert(amount4);

//====================Modify assign ==================================================
/* ------ ( /=  ডিভাইড ইকুয়াল ) --------------------- */
//====================================================================================

alert("Mim");

let amount5 = 300;
amount5 /= 100;
alert(amount5);
