"use strict";

let num = 1;
num += 1;
alert(num);

//========Increment Operators ( ++ ) == 1 করে বৃদ্ধি পাবে================

let num1 = 2;
num1++; // এখানে ++ দেওয়ায় 1 করে বৃদ্ধি পাবে এবং রেজাল্ট হবে (2+1) বা 3
alert(num1);

// ==============================================

let num2 = 5;
num2++;
num2++;
alert(num2);

/*এখানে দুই বার num2++; লেখায় রেজাল্ট হবে 7, কারণ 5 এর সাতে দুই বার 1 যোগ হবে (5+1+1)বা 7*/

//========Decrement Operators (- -) =========================

let num3 = 10;
num3--;
alert(num3);

/*এখানে Decrement Operators হিসাবে num--; ব্যবহার করায় প্রতিবার 1 করে কমবে। অর্থাৎ (10-1) বা 9 হবে ।*/

//===================================================================

let num4 = 6;
num4--;
num4--;
alert(num4);

/* এখানে Decrement Operators এ num4--; num4-- দুই বার লেখায় 2 কমবে, রেজাল্ট হবে (6-1-1)বা 4 */

//==11 মিনিট =====prefix ==পূর্বে ================নিয়ে আলোচনা ===========

let num5 = 8;
let num6 = ++num5;
alert(num6);

/*এখানে Increment Operators ( ++ ) variable এর পূর্বে অর্থাৎ prefix হিসাবে ব্যবহার হয়েছে তাই 1 বৃদ্ধি পেয়ে num6 নামক variable এর ভিতরে store হবে । */

let num7 = 10;
let num8 = --num7;
alert(num8);

/*এখানে decrement Operators ( -- ) variable এর পূর্বে অর্থাৎ prefix হিসাবে ব্যবহার হয়েছে তাই 1 বিয়োগ হয়ে num8 নামক variable এর ভিতরে store হবে । */

//==11 মিনিট =============postfix ==পরে =========নিয়ে আলোচনা ===========

let num9 = 60;
let num10 = num9++;
alert(num10);

/* (25 মিনিট )এখানে num10 নামক variable এর ভিতরে 60 Store হবে । 1 যোগ হবে না । কারণ postfix সবসময় পূর্বের value অর্থাৎ উপরের variable এর মান রিটান করে অর্থাৎ alert(num10); এর মাধ্যমে দেখা যাবে । কিন্তু postfix তার নিয়ম অনুযায়ী 1 যোগ করে । এই যোগটি দেখাতে হলে postfix এর সূত্র প্রয়োগকরতে হবে alert এর মাধ্যমে ।*/

let num11 = 30;
alert(num11++); // variable হিসাবে রিটান করবে 30 অর্থাৎ উপরের অর্থাৎ পূর্বের value
alert(num11); //  (25 মিনিট ) এখানে 1 যোগ হয়ে (30+1) বা 31 রিটান করবে

// ====== 28 মিনিট =======================================================

alert("Mim");

let amount = 80;
let result = 2 + amount;
alert(result); // এখানে 82 রিটান করবে

let amount1 = 80;
let amount2 = 2 + ++amount1;
alert(amount2);

/* এখানে 83 রিটান করবে, কারণ ++amount1 জন্য 1 বৃদ্ধি পেয়ে প্রথমে (80+1)বা 81 হবে, এই 81 সাথে 2 যোগ হয়ে (81+2) বা 83 হবে । */
