"use strict";

/* চিহ্নের ব্যবহার ---------------
> ------------- 65 > 56 --------- true -------- গেটার দ্যান
< ------------- 25 < 55 --------- true -------- লেস দ্যান

>= ------------ 65 >= 65 ------- true --------- গেটার দ্যান ইকুয়াল 
<= ------------ 89 <= 89 ------- true --------- লেস দ্যান ইকুয়াল 

== ------------ 5 == 8 --------- false --------- ইকুয়াল বা ডবল ইকুয়াল 

!= ------------ 25 != 58 ------- true --------- নট ইকুয়াল 
*/

alert(65 > 56);
/*===================================
      > গেটার দ্যান এর উদারহর 
===================================*/
console.log(65 > 56); // 65 কি 56 থেকে বড় ? উত্তর হলো হ্যাঁ তাই রেজাল্ট দেখাবে  true
console.log(65 > 65); // 65 কি 65 থেকে বড় ? উত্তর হলো না  তাই রেজাল্ট দেখাবে  false

/* ====================================
     <  লেস দ্যান এর উদারহর 
  ====================================*/
console.log(25 < 35); // 25 কি 35 থেকে ছোট ? উত্তর হলো হ্যাঁ  তাই রেজাল্ট দেখাবে true
console.log(40 < 35); // 40 কি 35 থেকে ছোট ? উত্তর হলো না  তাই রেজাল্ট দেখাবে false

/*====================================
      >= গেটার দ্যান ইকুয়াল এর উদারহর 
====================================*/
console.log(65 >= 65); // 65 কি 65 থেকে বড় ? উত্তর হলো না, কিন্তু 65 হলো 65 এর সমান  তাই রেজাল্ট দেখাবে true

console.log(65 >= 55); // 65 কি 55 থেকে বড় ? উত্তর হলো হ্যাঁ, কিন্তু 65 হলো 65 এর সমান  তাই রেজাল্ট দেখাবে true কারণ হেলো এখানে দুইটি শর্ত আছে যেকোন একটি শর্ত সত্য হলেই true হবে

console.log(65 >= 70); // 65 কি 70 থেকে বড় ? উত্তর হলো না, কিন্তু 65 হলো 70 এর সমানও নয়   তাই রেজাল্ট দেখাবে false কারণ হেলো এখানে দুইটি শর্ত আছে, এই  শর্ত  দুটির কোনটিই সত্য নহে তাই false হবে ।

/*====================================
       <= লেস  দ্যান ইকুয়াল এর উদারহর 
====================================*/

console.log(79 <= 90); // 79 কি 90 থেকে ছোট ? উত্তর হলো হ্যাঁ  তাই রেজাল্ট দেখাবে true

console.log(79 <= 79); // 79 কি 79 থেকে ছোট ? উত্তর হলো না, কিন্তু 79 হলো 79 এর সমান   তাই রেজাল্ট দেখাবে true ,  কারণ হেলো এখানে দুইটি শর্ত আছে, এই  শর্ত  দুটির যে কোন একটি মিলে গেলে true হয়।

console.log(85 <= 70); // 85 কি 70 থেকে ছোট ? উত্তর হলো না, কিন্তু 85 হলো 70 এর সমানও নয়   তাই রেজাল্ট দেখাবে false , কারণ হেলো এখানে দুইটি শর্ত আছে, এই  শর্ত  দুটির কোনটিই সত্য নহে তাই false হবে ।

/*====================================
  ==  ইকুয়াল বা ডবল ইকুয়াল  
====================================*/
console.log(50 == 80); // 50 কি 80 এর সমান ? উত্তর হলো না,  তাই রেজাল্ট দেখাবে false
console.log(50 == 50); // 50 কি 50 এর সমান ? উত্তর হলো হ্যাঁ,  তাই রেজাল্ট দেখাবে true

/*====================================
   !=  নট ইকুয়াল  
====================================*/
console.log(80 != 80); // 80 কি 80 এর সমান ? উত্তর হলো হ্যাঁ,  তাই রেজাল্ট দেখাবে false, কারণ শর্তানুসারে  !=  নট ইকুয়াল অর্থাৎ দুইটি মান সমান হওয়া যাবে না । সমান হওয়ায় false হয়েছে
console.log(80 != 70); // 80 কি 70 এর সমান ? উত্তর হলো না, তাই রেজাল্ট দেকাবে true

/* ========================================================
      =====variable start ======= 28 মিনিট ============
==========================================================*/
alert("Mim");

let test = 5 > 3;
alert(test); // true রিটান করবে

let test1 = 5 > 9;
alert(test1); // false রিটান করবে
