"use strict";

alert("Allaha");

//================================================

let count = 0; //  Begin (বিগিন) বলে

while (count <= 5) {
    // condition চেকিং বলে
    console.log("Mim");
    count++; // staping (স্টেপিং) বলে
}

//==================================================

/* 
for (let index = 0; index < array.length; index++) 

for সূত্রের ব্যাখ্যা :

let index = 0; কে Begin (বিগিন) বলে এই যায়গায় বাইরে যে  variable টি লিখতাম সেই  variable টি  এখানে লিখতে হয় । এই Begin (বিগিন) অর্থাৎ variable টি কেবল মাত্র for এর মধ্যে কাজ করে । বাহিরে কাজ করে না । 

( 11 মিনিট ) for এর মধ্যে যে variable ( let index = 0;) লেখা হয়। এটাকে inline variable বলে । এই inline variable এর কার্যক্ষমতা কেবলমাত্র for এর মধ্যে সীমাবদ্ধ । বাহিরে কাজ করে না । 

index < array.length; কে  condition চেকিং বলে । এই যায়গায় variable এর নাম অথবা  variable এর  নামের সাথে >= দিতে হয় 

index++ কে staping (স্টেপিং) বলে এই যায়গায় Begin (বিগিন) এর নামের সাথে হয় ++ অথবা - - দিতে হয় । */

//================================================================

for (let count1 = 0; count1 <= 5; count1++) {
    console.log("Zhumu " + count1);
}

//let count = 5 এই variable কে Begin (বিগিন) বলে

/* ======================================================
      ====== 11 মিনিট ===( count2--) ==============
=======================================================*/

for (let count2 = 8; count2; count2--) {
    console.log("Ibrahim" + count2);
}

//= 12 মিনিট == (let count3;) বাহিরে variable লেখার মাধ্যমে == for এর মধ্যে ব্যবহারের নিয়ম ==

let count3;
for (count3 = 0; count3 <= 3; count3++) {
    console.log("Pen " + count3);
}

console.log(count3);

// যদি কোন variable একই সাথে for এবং বাহিরে ব্যবহার করতে হয়, তাহলে variable টি বাহিরে Declear(ডিক্লিয়ার) করতে হবে । আর ভিতরে Define করলেই হয়ে যাবে ।

/* ======================================================
 ====== 14 মিনিট ========================
=======================================================*/

let count4 = 5;

for (; count4; count4--) {
    console.log("Jim " + count4);
}

// যদি variable এর মান সহ সম্পূর্ণ variable টি for এর বাহিরে রাখতে হয়। তাহলে for এর প্রথম বন্ধনির প্রথমেই ( ; ) সেমিকোলন দিতে হয় ।

/*===================================================================================
   == 16 মিনিট ==  count++; staping (স্টেপিং)== for loop এর body ভিতরে লেখার নিয়ম ==
===================================================================================*/

let count5 = 1;
for (; count5 < 4; ) {
    console.log("ABC " + count5);
    count5++;
}

//  count++; staping (স্টেপিং) for loop এর body ভিতরে নিচেই দেওয়া হয়েছে
